###################################################################

# Created by write_sdc on Sat Oct 26 18:57:32 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.05 [get_ports out_valid_order]
set_load -pin_load 0.05 [get_ports success]
set_load -pin_load 0.05 [get_ports out_valid_tot]
set_load -pin_load 0.05 [get_ports {sold_num[27]}]
set_load -pin_load 0.05 [get_ports {sold_num[26]}]
set_load -pin_load 0.05 [get_ports {sold_num[25]}]
set_load -pin_load 0.05 [get_ports {sold_num[24]}]
set_load -pin_load 0.05 [get_ports {sold_num[23]}]
set_load -pin_load 0.05 [get_ports {sold_num[22]}]
set_load -pin_load 0.05 [get_ports {sold_num[21]}]
set_load -pin_load 0.05 [get_ports {sold_num[20]}]
set_load -pin_load 0.05 [get_ports {sold_num[19]}]
set_load -pin_load 0.05 [get_ports {sold_num[18]}]
set_load -pin_load 0.05 [get_ports {sold_num[17]}]
set_load -pin_load 0.05 [get_ports {sold_num[16]}]
set_load -pin_load 0.05 [get_ports {sold_num[15]}]
set_load -pin_load 0.05 [get_ports {sold_num[14]}]
set_load -pin_load 0.05 [get_ports {sold_num[13]}]
set_load -pin_load 0.05 [get_ports {sold_num[12]}]
set_load -pin_load 0.05 [get_ports {sold_num[11]}]
set_load -pin_load 0.05 [get_ports {sold_num[10]}]
set_load -pin_load 0.05 [get_ports {sold_num[9]}]
set_load -pin_load 0.05 [get_ports {sold_num[8]}]
set_load -pin_load 0.05 [get_ports {sold_num[7]}]
set_load -pin_load 0.05 [get_ports {sold_num[6]}]
set_load -pin_load 0.05 [get_ports {sold_num[5]}]
set_load -pin_load 0.05 [get_ports {sold_num[4]}]
set_load -pin_load 0.05 [get_ports {sold_num[3]}]
set_load -pin_load 0.05 [get_ports {sold_num[2]}]
set_load -pin_load 0.05 [get_ports {sold_num[1]}]
set_load -pin_load 0.05 [get_ports {sold_num[0]}]
set_load -pin_load 0.05 [get_ports {total_gain[14]}]
set_load -pin_load 0.05 [get_ports {total_gain[13]}]
set_load -pin_load 0.05 [get_ports {total_gain[12]}]
set_load -pin_load 0.05 [get_ports {total_gain[11]}]
set_load -pin_load 0.05 [get_ports {total_gain[10]}]
set_load -pin_load 0.05 [get_ports {total_gain[9]}]
set_load -pin_load 0.05 [get_ports {total_gain[8]}]
set_load -pin_load 0.05 [get_ports {total_gain[7]}]
set_load -pin_load 0.05 [get_ports {total_gain[6]}]
set_load -pin_load 0.05 [get_ports {total_gain[5]}]
set_load -pin_load 0.05 [get_ports {total_gain[4]}]
set_load -pin_load 0.05 [get_ports {total_gain[3]}]
set_load -pin_load 0.05 [get_ports {total_gain[2]}]
set_load -pin_load 0.05 [get_ports {total_gain[1]}]
set_load -pin_load 0.05 [get_ports {total_gain[0]}]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid]
set_max_capacitance 0.15 [get_ports selling]
set_max_capacitance 0.15 [get_ports portion]
set_max_capacitance 0.15 [get_ports {ramen_type[1]}]
set_max_capacitance 0.15 [get_ports {ramen_type[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid]
set_max_fanout 10 [get_ports selling]
set_max_fanout 10 [get_ports portion]
set_max_fanout 10 [get_ports {ramen_type[1]}]
set_max_fanout 10 [get_ports {ramen_type[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid]
set_max_transition 3 [get_ports selling]
set_max_transition 3 [get_ports portion]
set_max_transition 3 [get_ports {ramen_type[1]}]
set_max_transition 3 [get_ports {ramen_type[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 5  [get_ports in_valid]
set_input_delay -clock clk  -min 0  [get_ports in_valid]
set_input_delay -clock clk  -max 5  [get_ports selling]
set_input_delay -clock clk  -min 0  [get_ports selling]
set_input_delay -clock clk  -max 5  [get_ports portion]
set_input_delay -clock clk  -min 0  [get_ports portion]
set_input_delay -clock clk  -max 5  [get_ports {ramen_type[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ramen_type[1]}]
set_input_delay -clock clk  -max 5  [get_ports {ramen_type[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ramen_type[0]}]
set_output_delay -clock clk  -max 5  [get_ports out_valid_order]
set_output_delay -clock clk  -min 0  [get_ports out_valid_order]
set_output_delay -clock clk  -max 5  [get_ports success]
set_output_delay -clock clk  -min 0  [get_ports success]
set_output_delay -clock clk  -max 5  [get_ports out_valid_tot]
set_output_delay -clock clk  -min 0  [get_ports out_valid_tot]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[27]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[27]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[26]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[26]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[25]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[25]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[24]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[24]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[23]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[23]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[22]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[22]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[21]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[21]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[20]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[20]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[19]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[19]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[18]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[18]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[17]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[17]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[16]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[16]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[15]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[15]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[14]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[14]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[13]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[13]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[12]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[12]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[11]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[11]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[10]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[10]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[9]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[9]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[8]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[8]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[7]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[7]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[6]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[6]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[5]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[5]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[4]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[4]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[3]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[3]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[2]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[2]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[1]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[1]}]
set_output_delay -clock clk  -max 5  [get_ports {sold_num[0]}]
set_output_delay -clock clk  -min 0  [get_ports {sold_num[0]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[14]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[14]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[13]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[13]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[12]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[12]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[11]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[11]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[10]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[10]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[9]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[9]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[8]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[8]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[7]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[7]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[6]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[6]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[5]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[5]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[4]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[4]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[3]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[3]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[2]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[2]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[1]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[1]}]
set_output_delay -clock clk  -max 5  [get_ports {total_gain[0]}]
set_output_delay -clock clk  -min 0  [get_ports {total_gain[0]}]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports selling]
set_input_transition -min 0.5  [get_ports selling]
set_input_transition -max 0.5  [get_ports portion]
set_input_transition -min 0.5  [get_ports portion]
set_input_transition -max 0.5  [get_ports {ramen_type[1]}]
set_input_transition -min 0.5  [get_ports {ramen_type[1]}]
set_input_transition -max 0.5  [get_ports {ramen_type[0]}]
set_input_transition -min 0.5  [get_ports {ramen_type[0]}]
