###################################################################

# Created by write_sdc on Sun Nov  3 21:04:05 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name enG30K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {out_data[7]}]
set_load -pin_load 0.05 [get_ports {out_data[6]}]
set_load -pin_load 0.05 [get_ports {out_data[5]}]
set_load -pin_load 0.05 [get_ports {out_data[4]}]
set_load -pin_load 0.05 [get_ports {out_data[3]}]
set_load -pin_load 0.05 [get_ports {out_data[2]}]
set_load -pin_load 0.05 [get_ports {out_data[1]}]
set_load -pin_load 0.05 [get_ports {out_data[0]}]
set_max_capacitance 0.15 [get_ports clk1]
set_max_capacitance 0.15 [get_ports clk2]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid]
set_max_capacitance 0.15 [get_ports {in_row[17]}]
set_max_capacitance 0.15 [get_ports {in_row[16]}]
set_max_capacitance 0.15 [get_ports {in_row[15]}]
set_max_capacitance 0.15 [get_ports {in_row[14]}]
set_max_capacitance 0.15 [get_ports {in_row[13]}]
set_max_capacitance 0.15 [get_ports {in_row[12]}]
set_max_capacitance 0.15 [get_ports {in_row[11]}]
set_max_capacitance 0.15 [get_ports {in_row[10]}]
set_max_capacitance 0.15 [get_ports {in_row[9]}]
set_max_capacitance 0.15 [get_ports {in_row[8]}]
set_max_capacitance 0.15 [get_ports {in_row[7]}]
set_max_capacitance 0.15 [get_ports {in_row[6]}]
set_max_capacitance 0.15 [get_ports {in_row[5]}]
set_max_capacitance 0.15 [get_ports {in_row[4]}]
set_max_capacitance 0.15 [get_ports {in_row[3]}]
set_max_capacitance 0.15 [get_ports {in_row[2]}]
set_max_capacitance 0.15 [get_ports {in_row[1]}]
set_max_capacitance 0.15 [get_ports {in_row[0]}]
set_max_capacitance 0.15 [get_ports {in_kernel[11]}]
set_max_capacitance 0.15 [get_ports {in_kernel[10]}]
set_max_capacitance 0.15 [get_ports {in_kernel[9]}]
set_max_capacitance 0.15 [get_ports {in_kernel[8]}]
set_max_capacitance 0.15 [get_ports {in_kernel[7]}]
set_max_capacitance 0.15 [get_ports {in_kernel[6]}]
set_max_capacitance 0.15 [get_ports {in_kernel[5]}]
set_max_capacitance 0.15 [get_ports {in_kernel[4]}]
set_max_capacitance 0.15 [get_ports {in_kernel[3]}]
set_max_capacitance 0.15 [get_ports {in_kernel[2]}]
set_max_capacitance 0.15 [get_ports {in_kernel[1]}]
set_max_capacitance 0.15 [get_ports {in_kernel[0]}]
set_max_fanout 10 [get_ports clk1]
set_max_fanout 10 [get_ports clk2]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid]
set_max_fanout 10 [get_ports {in_row[17]}]
set_max_fanout 10 [get_ports {in_row[16]}]
set_max_fanout 10 [get_ports {in_row[15]}]
set_max_fanout 10 [get_ports {in_row[14]}]
set_max_fanout 10 [get_ports {in_row[13]}]
set_max_fanout 10 [get_ports {in_row[12]}]
set_max_fanout 10 [get_ports {in_row[11]}]
set_max_fanout 10 [get_ports {in_row[10]}]
set_max_fanout 10 [get_ports {in_row[9]}]
set_max_fanout 10 [get_ports {in_row[8]}]
set_max_fanout 10 [get_ports {in_row[7]}]
set_max_fanout 10 [get_ports {in_row[6]}]
set_max_fanout 10 [get_ports {in_row[5]}]
set_max_fanout 10 [get_ports {in_row[4]}]
set_max_fanout 10 [get_ports {in_row[3]}]
set_max_fanout 10 [get_ports {in_row[2]}]
set_max_fanout 10 [get_ports {in_row[1]}]
set_max_fanout 10 [get_ports {in_row[0]}]
set_max_fanout 10 [get_ports {in_kernel[11]}]
set_max_fanout 10 [get_ports {in_kernel[10]}]
set_max_fanout 10 [get_ports {in_kernel[9]}]
set_max_fanout 10 [get_ports {in_kernel[8]}]
set_max_fanout 10 [get_ports {in_kernel[7]}]
set_max_fanout 10 [get_ports {in_kernel[6]}]
set_max_fanout 10 [get_ports {in_kernel[5]}]
set_max_fanout 10 [get_ports {in_kernel[4]}]
set_max_fanout 10 [get_ports {in_kernel[3]}]
set_max_fanout 10 [get_ports {in_kernel[2]}]
set_max_fanout 10 [get_ports {in_kernel[1]}]
set_max_fanout 10 [get_ports {in_kernel[0]}]
set_max_transition 3 [get_ports clk1]
set_max_transition 3 [get_ports clk2]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid]
set_max_transition 3 [get_ports {in_row[17]}]
set_max_transition 3 [get_ports {in_row[16]}]
set_max_transition 3 [get_ports {in_row[15]}]
set_max_transition 3 [get_ports {in_row[14]}]
set_max_transition 3 [get_ports {in_row[13]}]
set_max_transition 3 [get_ports {in_row[12]}]
set_max_transition 3 [get_ports {in_row[11]}]
set_max_transition 3 [get_ports {in_row[10]}]
set_max_transition 3 [get_ports {in_row[9]}]
set_max_transition 3 [get_ports {in_row[8]}]
set_max_transition 3 [get_ports {in_row[7]}]
set_max_transition 3 [get_ports {in_row[6]}]
set_max_transition 3 [get_ports {in_row[5]}]
set_max_transition 3 [get_ports {in_row[4]}]
set_max_transition 3 [get_ports {in_row[3]}]
set_max_transition 3 [get_ports {in_row[2]}]
set_max_transition 3 [get_ports {in_row[1]}]
set_max_transition 3 [get_ports {in_row[0]}]
set_max_transition 3 [get_ports {in_kernel[11]}]
set_max_transition 3 [get_ports {in_kernel[10]}]
set_max_transition 3 [get_ports {in_kernel[9]}]
set_max_transition 3 [get_ports {in_kernel[8]}]
set_max_transition 3 [get_ports {in_kernel[7]}]
set_max_transition 3 [get_ports {in_kernel[6]}]
set_max_transition 3 [get_ports {in_kernel[5]}]
set_max_transition 3 [get_ports {in_kernel[4]}]
set_max_transition 3 [get_ports {in_kernel[3]}]
set_max_transition 3 [get_ports {in_kernel[2]}]
set_max_transition 3 [get_ports {in_kernel[1]}]
set_max_transition 3 [get_ports {in_kernel[0]}]
create_clock [get_ports clk1]  -period 47.1  -waveform {0 23.55}
set_clock_uncertainty 0.1  [get_clocks clk1]
set_clock_transition -max -rise 0.1 [get_clocks clk1]
set_clock_transition -max -fall 0.1 [get_clocks clk1]
set_clock_transition -min -rise 0.1 [get_clocks clk1]
set_clock_transition -min -fall 0.1 [get_clocks clk1]
create_clock [get_ports clk2]  -period 10.1  -waveform {0 5.05}
set_clock_uncertainty 0.1  [get_clocks clk2]
set_clock_transition -max -rise 0.1 [get_clocks clk2]
set_clock_transition -max -fall 0.1 [get_clocks clk2]
set_clock_transition -min -rise 0.1 [get_clocks clk2]
set_clock_transition -min -fall 0.1 [get_clocks clk2]
set_input_delay -clock clk1  0  [get_ports clk1]
set_input_delay -clock clk2  0  [get_ports clk2]
set_input_delay -clock clk1  0  [get_ports rst_n]
set_input_delay -clock clk1  -max 23.55  [get_ports in_valid]
set_input_delay -clock clk1  -min 0  [get_ports in_valid]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[17]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[17]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[16]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[16]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[15]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[15]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[14]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[14]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[13]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[13]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[12]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[12]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[11]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[11]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[10]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[10]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[9]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[9]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[8]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[8]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[7]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[7]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[6]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[6]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[5]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[5]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[4]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[4]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[3]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[3]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[2]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[2]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[1]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[1]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_row[0]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_row[0]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[11]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[11]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[10]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[10]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[9]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[9]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[8]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[8]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[7]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[7]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[6]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[6]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[5]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[5]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[4]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[4]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[3]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[3]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[2]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[2]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[1]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[1]}]
set_input_delay -clock clk1  -max 23.55  [get_ports {in_kernel[0]}]
set_input_delay -clock clk1  -min 0  [get_ports {in_kernel[0]}]
set_output_delay -clock clk1  -max 23.55  [get_ports out_valid]
set_output_delay -clock clk1  -min 0  [get_ports out_valid]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[7]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[7]}]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[6]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[6]}]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[5]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[5]}]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[4]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[4]}]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[3]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[3]}]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[2]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[2]}]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[1]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[1]}]
set_output_delay -clock clk1  -max 23.55  [get_ports {out_data[0]}]
set_output_delay -clock clk1  -min 0  [get_ports {out_data[0]}]
set_clock_groups  -asynchronous -name group1  -group [get_clocks clk1] -group  \
[get_clocks clk2]
set_input_transition -max 0.5  [get_ports clk1]
set_input_transition -min 0.5  [get_ports clk1]
set_input_transition -max 0.5  [get_ports clk2]
set_input_transition -min 0.5  [get_ports clk2]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports {in_row[17]}]
set_input_transition -min 0.5  [get_ports {in_row[17]}]
set_input_transition -max 0.5  [get_ports {in_row[16]}]
set_input_transition -min 0.5  [get_ports {in_row[16]}]
set_input_transition -max 0.5  [get_ports {in_row[15]}]
set_input_transition -min 0.5  [get_ports {in_row[15]}]
set_input_transition -max 0.5  [get_ports {in_row[14]}]
set_input_transition -min 0.5  [get_ports {in_row[14]}]
set_input_transition -max 0.5  [get_ports {in_row[13]}]
set_input_transition -min 0.5  [get_ports {in_row[13]}]
set_input_transition -max 0.5  [get_ports {in_row[12]}]
set_input_transition -min 0.5  [get_ports {in_row[12]}]
set_input_transition -max 0.5  [get_ports {in_row[11]}]
set_input_transition -min 0.5  [get_ports {in_row[11]}]
set_input_transition -max 0.5  [get_ports {in_row[10]}]
set_input_transition -min 0.5  [get_ports {in_row[10]}]
set_input_transition -max 0.5  [get_ports {in_row[9]}]
set_input_transition -min 0.5  [get_ports {in_row[9]}]
set_input_transition -max 0.5  [get_ports {in_row[8]}]
set_input_transition -min 0.5  [get_ports {in_row[8]}]
set_input_transition -max 0.5  [get_ports {in_row[7]}]
set_input_transition -min 0.5  [get_ports {in_row[7]}]
set_input_transition -max 0.5  [get_ports {in_row[6]}]
set_input_transition -min 0.5  [get_ports {in_row[6]}]
set_input_transition -max 0.5  [get_ports {in_row[5]}]
set_input_transition -min 0.5  [get_ports {in_row[5]}]
set_input_transition -max 0.5  [get_ports {in_row[4]}]
set_input_transition -min 0.5  [get_ports {in_row[4]}]
set_input_transition -max 0.5  [get_ports {in_row[3]}]
set_input_transition -min 0.5  [get_ports {in_row[3]}]
set_input_transition -max 0.5  [get_ports {in_row[2]}]
set_input_transition -min 0.5  [get_ports {in_row[2]}]
set_input_transition -max 0.5  [get_ports {in_row[1]}]
set_input_transition -min 0.5  [get_ports {in_row[1]}]
set_input_transition -max 0.5  [get_ports {in_row[0]}]
set_input_transition -min 0.5  [get_ports {in_row[0]}]
set_input_transition -max 0.5  [get_ports {in_kernel[11]}]
set_input_transition -min 0.5  [get_ports {in_kernel[11]}]
set_input_transition -max 0.5  [get_ports {in_kernel[10]}]
set_input_transition -min 0.5  [get_ports {in_kernel[10]}]
set_input_transition -max 0.5  [get_ports {in_kernel[9]}]
set_input_transition -min 0.5  [get_ports {in_kernel[9]}]
set_input_transition -max 0.5  [get_ports {in_kernel[8]}]
set_input_transition -min 0.5  [get_ports {in_kernel[8]}]
set_input_transition -max 0.5  [get_ports {in_kernel[7]}]
set_input_transition -min 0.5  [get_ports {in_kernel[7]}]
set_input_transition -max 0.5  [get_ports {in_kernel[6]}]
set_input_transition -min 0.5  [get_ports {in_kernel[6]}]
set_input_transition -max 0.5  [get_ports {in_kernel[5]}]
set_input_transition -min 0.5  [get_ports {in_kernel[5]}]
set_input_transition -max 0.5  [get_ports {in_kernel[4]}]
set_input_transition -min 0.5  [get_ports {in_kernel[4]}]
set_input_transition -max 0.5  [get_ports {in_kernel[3]}]
set_input_transition -min 0.5  [get_ports {in_kernel[3]}]
set_input_transition -max 0.5  [get_ports {in_kernel[2]}]
set_input_transition -min 0.5  [get_ports {in_kernel[2]}]
set_input_transition -max 0.5  [get_ports {in_kernel[1]}]
set_input_transition -min 0.5  [get_ports {in_kernel[1]}]
set_input_transition -max 0.5  [get_ports {in_kernel[0]}]
set_input_transition -min 0.5  [get_ports {in_kernel[0]}]
